{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.5"}},"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Yl9npCt8n6m-","executionInfo":{"status":"ok","timestamp":1634627582894,"user_tz":-120,"elapsed":5025,"user":{"displayName":"Laurisa Garps","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjJzAvnVgQeOMzd_CS07ajDjwwwvmbIfD6QOXdt=s64","userId":"05013547907685842298"}},"outputId":"ab8d9224-53fc-4634-a455-420e2a232aa1"},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2021-2022/master/Assignment4/course_materials\""],"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting rdflib\n","  Downloading rdflib-6.0.2-py3-none-any.whl (407 kB)\n","\u001b[K     |████████████████████████████████| 407 kB 2.8 MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.7/dist-packages (from rdflib) (2.4.7)\n","Requirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from rdflib) (57.4.0)\n","Collecting isodate\n","  Downloading isodate-0.6.0-py2.py3-none-any.whl (45 kB)\n","\u001b[K     |████████████████████████████████| 45 kB 2.8 MB/s \n","\u001b[?25hRequirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from isodate->rdflib) (1.15.0)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.0 rdflib-6.0.2\n"]}]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["Leemos el fichero RDF de la forma que lo hemos venido haciendo"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9ERh415on7kF","executionInfo":{"status":"ok","timestamp":1634627588261,"user_tz":-120,"elapsed":877,"user":{"displayName":"Laurisa Garps","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjJzAvnVgQeOMzd_CS07ajDjwwwvmbIfD6QOXdt=s64","userId":"05013547907685842298"}},"outputId":"eac8577a-6424-4175-99a6-098168b9dfb8"},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/rdf/example6.rdf\", format=\"xml\")"],"execution_count":2,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N572adfbcbaaa4733bd8e4468468bf2c8 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{},"execution_count":2}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"tRcSWuMHOXBl","executionInfo":{"status":"ok","timestamp":1634628314224,"user_tz":-120,"elapsed":370,"user":{"displayName":"Laurisa Garps","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjJzAvnVgQeOMzd_CS07ajDjwwwvmbIfD6QOXdt=s64","userId":"05013547907685842298"}},"outputId":"05c7b9fb-4888-4c87-b543-79ba32c396ea"},"source":["# TO DO\n","# Visualize the results\n","\n","#for r in g.query(q1):\n","#  print(r)\n","\n","from rdflib.plugins.sparql import prepareQuery\n","q1 = prepareQuery('''\n","    SELECT ?sc\n","    WHERE {\n","      ?sc rdfs:subClassOf ns:Person.\n","    }''', initNs = {\"rdfs\": RDFS, \"ns\": ns})\n","\n","for r in g.query(q1):\n","  print(r)\n","\n","# ns = Namespace(\"http://somewhere#\") comprobación\n","# for s, p, o in g.triples((None, RDFS.subClassOf, ns.Person)):\n","  # print(s,p,o)"],"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#Researcher'),)\n"]}]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"LiKSPHRzS-XJ","executionInfo":{"status":"ok","timestamp":1634628536816,"user_tz":-120,"elapsed":455,"user":{"displayName":"Laurisa Garps","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjJzAvnVgQeOMzd_CS07ajDjwwwvmbIfD6QOXdt=s64","userId":"05013547907685842298"}},"outputId":"f9a6a1da-ea02-4049-e1d3-0ddcd09da24d"},"source":["# TO DO\n","# Visualize the results\n","\n","for s, p, o in g.triples((None, RDF.type, ns.Person)):\n","  print(s, p, o)\n","\n","for triple in g.triples((None, RDFS.subClassOf, ns.Person)):\n","  for s1, p1, o1 in g.triples((None, RDF.type, triple[0])):\n","    print(s1, p1, o1)"],"execution_count":11,"outputs":[{"output_type":"stream","name":"stdout","text":["http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"]}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"bni1CMDMdDpJ","executionInfo":{"status":"ok","timestamp":1634628700050,"user_tz":-120,"elapsed":482,"user":{"displayName":"Laurisa Garps","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjJzAvnVgQeOMzd_CS07ajDjwwwvmbIfD6QOXdt=s64","userId":"05013547907685842298"}},"outputId":"26ea4d63-1d5e-42b9-d52e-744730c7b0f2"},"source":["q2 = prepareQuery('''\n","    SELECT ?p\n","    WHERE {\n","      { ?p rdf:type ns:Person.\n","    } UNION {?sc rdfs:subClassOf ns:Person.\n","    ?p rdf:type ?sc }\n","    }\n","    ''', initNs = {\"rdf\": RDF, \"rdfs\": RDFS, \"ns\": ns})\n","\n","for r2 in g.query(q2):\n","  print(r2)"],"execution_count":12,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#SaraJones'),)\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'),)\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'),)\n"]}]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\n"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"APQGv3NHX8Tf","executionInfo":{"status":"ok","timestamp":1634629067473,"user_tz":-120,"elapsed":469,"user":{"displayName":"Laurisa Garps","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjJzAvnVgQeOMzd_CS07ajDjwwwvmbIfD6QOXdt=s64","userId":"05013547907685842298"}},"outputId":"23683c67-a8fb-494b-c85b-593de76fcde0"},"source":["# TO DO\n","# Visualize the results\n","for s, p, o in g.triples((None, RDF.type, ns.Person)):\n","  for s1, p1, o1 in g.triples((s, None, None)):\n","    print(s1, p1, o1)\n","\n","for s, p, o in g.triples((None, RDFS.subClassOf, ns.Person)):\n","  for s1, p1, o1 in g.triples((None, RDF.type, s)):\n","    for s2, p2, o2 in g.triples((s1, None, None)):\n","      print(s2, p2, o2)"],"execution_count":15,"outputs":[{"output_type":"stream","name":"stdout","text":["http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n"]}]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"r6wE1JmVeAAG","executionInfo":{"status":"ok","timestamp":1634628945820,"user_tz":-120,"elapsed":491,"user":{"displayName":"Laurisa Garps","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GjJzAvnVgQeOMzd_CS07ajDjwwwvmbIfD6QOXdt=s64","userId":"05013547907685842298"}},"outputId":"8cef28b2-c689-4c2a-8a03-89f0ecf9f3b5"},"source":["q3 = prepareQuery('''\n","    SELECT ?p ?prop1 ?prop2\n","    WHERE {\n","      { ?p rdf:type ns:Person. \n","        ?p ?prop1 ?prop2\n","      } UNION{\n","        ?sc rdfs:subClassOf ns:Person. \n","        ?p rdf:type ?sc.\n","        ?p ?prop1 ?prop2\n","      }\n","    }''', initNs = {\"rdf\": RDF, \"rdfs\": RDFS, \"ns\": ns})\n","\n","for r3 in g.query(q3):\n","  print(r3)"],"execution_count":14,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Person'))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('Sara', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('Sara Jones', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Jones', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Person'))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('John', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('John Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Researcher'))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('Jane', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('jane Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n"]}]}]}